{
  "CommonApiError": "The server can't process the request.Try it later or contact with the site administrator.",
  "EmployeeNotExist": "The specified employee not exist in system. Please check your data and ensure that employee exist.",
  "CostCenterNotExist": "The specified cost center {0} not exist in system. Please check your data and ensure that cost center exist.",
  "NotAuhtorized": "The operation cannot be performed by the user",
  "ReportNotExist": "The specified report, not exist in system.Please check your data.",
  "CantModifyReport": "The report cannot be modified because is not in valid state",
  "CantDeleteReportInNotValidState": "The report cannot be deleted because is already approved, rejected or reimbursed.",
  "CantChangeReimburseMode": "Can't change reimburse mode in reimbursed or rejected report.",
  "OnlyManagerCanApproveReport": "Only manager can approve reports, the user is not manager and can't approve this report.",
  "CantApproveNonSubmittedReport": "Non submitted report can't be approved",
  "OnlyManagerCanRejectReport": "Only manager can reject reports, the user is not manager for the team and can't reject this report",
  "CantRejectNonSubmittedReport": "Non submitted report report can't be rejected",
  "OnlyManagerCanReimburseReport": "Only manager can reimburse reports, the user is not the manager for the team and can't reimburse this report.",
  "CantReimburseNonApprovedReport": "Non approved report can't be billed",
  "RejectedOrReimbursedCantBeCloned": "Only non rejected or reimbursed report can be cloned.",
  "CantSubmitNonUnsubmittedReport": "Non unsubmitted report can't be summited",
  "CategoryNotExist": "The specified category not exist in the system. Please check your data",
  "InvalidInputRecurrentPatternDateTo": "The enabledTo is greather than enabledFrom",
  "ExpenseNotExist": "The expense not exist",
  "CantDeleteExpenseInNotValidState": "The Expense cant be deleted because the report is not in valid state to be deleted.",
  "InvalidProductId": "Invalid product id",
  "NoPoints": "Can't buy without points",
  "CantAddNegativePointsIntoAccount": "The amount of points need be greather than zero",
  "NotEnoughPointInAccount": "The number of points to spend is greather that existing points in the account"
}